EDT/УТ/src/Documents/мгУстановкаЗначенийКатегорииЗаказов/мгУстановкаЗначенийКатегорииЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгУстановкаЗначенийКатегорииЗаказов</name>
  <registerRecords>InformationRegister.мгЗначенияКатегорийЗаказов</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.мгКатегорииЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗаказаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВключительноОт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗаказаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВключительноДо</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/мгЗначенияКатегорийЗаказов/мгЗначенияКатегорийЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгЗначенияКатегорийЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВесЗаказаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВключительноОт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВесЗаказаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВключительноДо</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.мгКатегорииЗаказов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/мгУстановкаЗначенийКатегорииЗаказов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мгЗначенияКатегорийЗаказов
	Движения.мгЗначенияКатегорийЗаказов.Записывать = Истина;
	Движения.мгЗначенияКатегорийЗаказов.Очистить();
	Для Каждого ТекСтрокаДанные Из Данные Цикл
		Движение = Движения.мгЗначенияКатегорийЗаказов.Добавить();
		Движение.Период = Дата;
		Движение.Категория = ТекСтрокаДанные.Категория;
		Движение.ВесЗаказаОт = ТекСтрокаДанные.ВесЗаказаОт;
		Движение.ВключительноОт = ТекСтрокаДанные.ВключительноОт;
		Движение.ВесЗаказаДо = ТекСтрокаДанные.ВесЗаказаДо;
		Движение.ВключительноДо = ТекСтрокаДанные.ВключительноДо;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
